import pandas as pd

## โจทย์ ต้องการเลือกยาสีฟันมาใช้ในโรงเรียน โดยพิจารณาให้คะแนนผลิตภัณฑ์เต็ม100 คะแนน
##มีร้านมาเสนอทั้งหมด 4 ยี่ห้อ ชื่อ ราคา และได้คะแนนดังนี้
##พิจารณาเลือกโดยใช้เกณฑ์คะแนนผลิตภัณฑ์ต้องมากกว่า 60 คะแนน
##และเลือกยี่ห้อที่มีราคาต่ำสุด


data = {'name':(['colg','denti','senz','fluor','denta']),
        'price':(['40','54','38','65','45']),
        'score':(['65.4','84.5','59.1','76.2','64.5'])}
df = pd.DataFrame(data)

df['price'] = df['price'].astype('int')
df['score'] = df['score'].astype('float')


w = df.query('score >=60')
z = w.min()[['name','price']]
            
print(z)

 
## ผลการคัดเลือก ได้ยาสีฟัน ยี่ห้อ colg ราคา 40 บาท
